#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	
	//-------------------------------САМА ПРОГА-------------------------------------
	int x;

	int a, b, c;

	cout << "Введите трёх значное число: ";
	cin >> x;

	c = x % 10;

	cout << c << endl;

	b = (x / 10) % 10;

	cout << b << endl;

	a = (x / 100);

	cout << a << endl;

	if (a == b || a == c || b == c)
	{
		cout << "В числе:  " << a << b << c << " Есть одинаковые цифры!" << endl;
	}
	else
	{
		cout << "В числе " << a << b << c << " Нету одинаковых цифр!" << endl;
	}

	system("pause");

	return 0;
}
